eisup_2019_docmng_integration/src/BusinessProcesses/абсСогласованиеБюджета/абсСогласованиеБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>абсСогласованиеБюджета</name>
  <task>Task.абсЗадачаДоговора</task>
  <attributes>
    <name>ДокументВводаБюджета</name>
    <type>
      <types>DocumentRef.абс_ВводБюджета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИнициаторБП</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусУточнения</name>
    <type>
      <types>EnumRef.абс_СтатусыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОтмены</name>
    <type>
      <types>EnumRef.абс_СтатусыБюджетов</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыБюджетов/абс_СтатусыБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыБюджетов</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Уточнение</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЦФО</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЦФУ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДирБА</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭИ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДК</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаДирБА</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПВП</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_Бюджет/абс_Бюджет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_Бюджет</name>
  <enumValues>
    <name>абс_ДДС_ОРЕХ</name>
  </enumValues>
  <enumValues>
    <name>абс_ДДС_САРЕХ</name>
  </enumValues>
  <enumValues>
    <name>абс_ОРЕХ</name>
  </enumValues>
  <enumValues>
    <name>абс_САРЕХ</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абсВидыБизнесПроцессовТТК/абсВидыБизнесПроцессовТТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсВидыБизнесПроцессовТТК</name>
  <enumValues>
    <name>СогласованиеКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДоговоров</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЗакупочныхЗаказов</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеСчетовНаОплату</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПервичныхДокументов</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЗаявкиНаСклад</name>
  </enumValues>
  <enumValues>
    <name>РекласификацияБюджета</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкиВПоддержку</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПланаБюджета</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаИзменениеРеквизитов</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНоменклатурныхГрупп</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеСтатейЗатрат</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДоговоровПодряда</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеАктовПриёмкиВыполненныхРабот</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЗаявокНаПроект</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеСчетовНаОплатуФилиализация</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/BusinessProcesses/абсСогласованиеБюджета/ObjectModule.bsl
// Общие процедуры и функции
Процедура ОткрытьВводБюджета()
	
	ФормаВводаБюджета = ДокументВводаБюджета.ПолучитьФорму("ФормаДокумента");
	
	Если ФормаВводаБюджета.Открыта() Тогда
		ФормаВводаБюджета.Активизировать();
	Иначе
		ФормаВводаБюджета.Открыть();
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьЗадачуИнициатору(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	ФормируемыеЗадачи.Очистить();	
	//АБС ВСТАВКА 36495  20.02.2014 11:20:34  Родин  Оптимизация бизнес-процессов
	абс_БизнесПроцессы.СформироватьЗадачуВводБюджета(ЭтотОбъект.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, ПользовательИнициаторБП, Отказ,,,Неопределено);
	//АБС ВСТАВКА 36495  20.02.2014 11:20:34  Родин  Оптимизация бизнес-процессов
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, ДокументВводаБюджета, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);	
	
КонецПроцедуры

Процедура СформироватьГрупповуюЗадачу(ТочкаМаршрута, ФормируемыеЗадачи, Отказ = Ложь, Организация = Неопределено) Экспорт
	
	ФормируемыеЗадачи.Очистить();
	//АБС ВСТАВКА 36495  20.02.2014 11:20:34  Родин  Оптимизация бизнес-процессов
	абс_БизнесПроцессы.СформироватьЗадачуИсполнителямВводБюджета(ЭтотОбъект.Ссылка, ТочкаМаршрута, ФормируемыеЗадачи, ,Организация);
	//АБС ВСТАВКА 36495  20.02.2014 11:20:34  Родин  Оптимизация бизнес-процессов
	Если ФормируемыеЗадачи.Количество() = 0 Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Ошибка при формировании задач. На найдено ответственных.", Отказ);
		Возврат;
	КонецЕсли;
	
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, ДокументВводаБюджета, ТочкаМаршрута, ФормируемыеЗадачи);
	
КонецПроцедуры

// Процедуры-обработчики ПриИнтрерактивнойАктивации
Процедура ДействиеСогласованиеЦФООбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьВводБюджета();
	
КонецПроцедуры

Процедура ДействиеСогласованиеЦФУОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьВводБюджета();

КонецПроцедуры

Процедура ДействиеСогласованиеДирБАОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьВводБюджета();

КонецПроцедуры

Процедура ДействиеСогласованиеДЭИОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ОткрытьВводБюджета();

КонецПроцедуры

Процедура ДействиеДКОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ОткрытьВводБюджета();

КонецПроцедуры

Процедура ДействиеОтказОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ОткрытьВводБюджета();

КонецПроцедуры

Процедура ДействиеУточнениеОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ОткрытьВводБюджета();

КонецПроцедуры

Процедура ДействиеПроверкаДирБАОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьВводБюджета();
		
КонецПроцедуры

// Процедуры-обработчики вариантов маршрута
Процедура ВыборВариантаСогласованинеЦФООбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
		//АБС 3062	
	//Если ДокументВводаБюджета.Статус = Перечисления.абс_СтатусыБюджетов.ПроверкаДирБА Тогда
	Если ДокументВводаБюджета.Статус = Перечисления.абс_СтатусыБюджетов.СогласованиеЦФУ Тогда
	//АБС 3062		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласовано;
		
	ИначеЕсли ДокументВводаБюджета.Статус = Перечисления.абс_СтатусыБюджетов.Уточнение Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантУточнение;
		
	ИначеЕсли ДокументВводаБюджета.Статус = Перечисления.абс_СтатусыБюджетов.Отмена Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтмена;
		
		// АБС ВСТАВКА Фролов 20120126 Убираем статус Согласование ЦФУ. Инициатор Калымкин.
	ИначеЕсли ДокументВводаБюджета.Статус = Перечисления.абс_СтатусыБюджетов.СогласованиеДирБА Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеБюджета;
		
	ИначеЕсли ДокументВводаБюджета.Статус = Перечисления.абс_СтатусыБюджетов.СогласованиеДК Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеБюджета;
		
	ИначеЕсли ДокументВводаБюджета.Статус = Перечисления.абс_СтатусыБюджетов.СогласованиеДЭИ Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеБюджета;
		
		// АБС ВСТАВКА Фролов 20120126 Убираем статус Согласование ЦФУ. Инициатор Калымкин. КОНЕЦ
	Иначе
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыборВариантаСогласованиеЦФУОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	Если 	ДокументВводаБюджета.Статус = Перечисления.абс_СтатусыБюджетов.СогласованиеДирБА Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласовано;
		
	ИначеЕсли ДокументВводаБюджета.Статус = Перечисления.абс_СтатусыБюджетов.Уточнение Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантУточнение;
		
	ИначеЕсли ДокументВводаБюджета.Статус = Перечисления.абс_СтатусыБюджетов.Отмена Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтмена;		
		
	Иначе
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
		
	КонецЕсли;	

КонецПроцедуры

Процедура ВыборВариантаСогласованиеДирБАДЭИДКОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	Если ДокументВводаБюджета.Статус = Перечисления.абс_СтатусыБюджетов.Утвержден
	 ИЛИ ДокументВводаБюджета.Статус = Перечисления.абс_СтатусыБюджетов.СогласованиеПВП Тогда  //АБС Коломиец 19255
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласовано;
		
	ИначеЕсли ДокументВводаБюджета.Статус = Перечисления.абс_СтатусыБюджетов.Уточнение Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантУточнение;
		
	ИначеЕсли ДокументВводаБюджета.Статус = Перечисления.абс_СтатусыБюджетов.Отмена Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтмена;		
		
	Иначе
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ВыборВариантаПроверкаДирБАОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	//АБС 3062	
	//Если ДокументВводаБюджета.Статус = Перечисления.абс_СтатусыБюджетов.СогласованиеЦФУ Тогда
	Если ДокументВводаБюджета.Статус = Перечисления.абс_СтатусыБюджетов.СогласованиеЦФО Тогда
	//АБС 3062		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласовано;
		
	ИначеЕсли ДокументВводаБюджета.Статус = Перечисления.абс_СтатусыБюджетов.Уточнение Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантУточнение;
		
	ИначеЕсли ДокументВводаБюджета.Статус = Перечисления.абс_СтатусыБюджетов.Отмена Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтмена;
		
	Иначе
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
		
	КонецЕсли;
		
КонецПроцедуры

// Процедуры-обработчики ПриСозданииЗадач
Процедура ДействиеСогласованиеЦФОПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт	
	
	МассивИсполнителей = абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(
		абс_БизнесПроцессы.ПолучитьОтветственныхПодразделения(ДокументВводаБюджета.ЦФО,,ДокументВводаБюджета.Организация));
	
	Если МассивИсполнителей.Количество() = 0 Тогда
		
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не найдено ответственных для ЦФО: " + ДокументВводаБюджета.ЦФО + ".", Отказ);
		Возврат;
	КонецЕсли;
	
	абс_БизнесПроцессы.СформироватьЗадачуИсполнителямВводБюджета(ЭтотОбъект.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, МассивИсполнителей);
	
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, ДокументВводаБюджета, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);	
	
КонецПроцедуры

Процедура ДействиеСогласованиеЦФУПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
			
	МассивИсполнителей = абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(
		абс_БизнесПроцессы.ПолучитьОтветственныхПодразделения(ДокументВводаБюджета.ЦФУ,, ДокументВводаБюджета.Организация));
	
	Если МассивИсполнителей.Количество() = 0 Тогда
		
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не найдено ответственных для ЦФУ: " + ДокументВводаБюджета.ЦФУ + ".", Отказ);
		Возврат;
	КонецЕсли;
	
	абс_БизнесПроцессы.СформироватьЗадачуИсполнителямВводБюджета(ЭтотОбъект.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, МассивИсполнителей);
	
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, ДокументВводаБюджета, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);	
	
КонецПроцедуры

Процедура ДействиеСогласованиеДирБАПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	ОрганизацияКТТК = Справочники.Организации.НайтиПоНаименованию("КТТК");
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ, ОрганизацияКТТК);	

КонецПроцедуры

Процедура ДействиеСогласованиеДЭИПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	ОрганизацияКТТК = Справочники.Организации.НайтиПоНаименованию("КТТК");
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);	

КонецПроцедуры

Процедура ДействиеДКПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
КонецПроцедуры

Процедура ДействиеОтказПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьЗадачуИнициатору(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
КонецПроцедуры

Процедура ДействиеУточнениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьЗадачуИнициатору(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
КонецПроцедуры

Процедура ДействиеПроверкаДирБАПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
 		
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ, ДокументВводаБюджета.Организация);
	
КонецПроцедуры

Процедура ВыборВариантаСтатусУточненияОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	Если СтатусУточнения = Перечисления.абс_СтатусыБюджетов.СогласованиеЦФО Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантУточнениеЦФО;
		
	ИначеЕсли СтатусУточнения = Перечисления.абс_СтатусыБюджетов.ПроверкаДирБА Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантУточнениеПроверкаНаКорректность;
		
	ИначеЕсли СтатусУточнения = Перечисления.абс_СтатусыБюджетов.СогласованиеЦФУ Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантУточнениеПроверкаНаКорректность;
		
	ИначеЕсли СтатусУточнения = Перечисления.абс_СтатусыБюджетов.СогласованиеДирБА Тогда
			  
		Результат = ТочкаВыбораВарианта.Варианты.ВариантУточнениеСогласованиеБюджета;
		
	ИначеЕсли СтатусУточнения = Перечисления.абс_СтатусыБюджетов.СогласованиеДЭИ Тогда
			  
		Результат = ТочкаВыбораВарианта.Варианты.ВариантУточнениеСогласованиеБюджета;
		
	ИначеЕсли СтатусУточнения = Перечисления.абс_СтатусыБюджетов.СогласованиеДК Тогда
			  
		Результат = ТочкаВыбораВарианта.Варианты.ВариантУточнениеСогласованиеБюджета;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыборВариантаСтатусОтменыОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	//СтатусОтмены = ДокументВводаБюджета.СтатусОтмены;
	
	Если СтатусОтмены = Перечисления.абс_СтатусыБюджетов.ПроверкаДирБА Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтменаПроверкаНаКорректность;
		
	ИначеЕсли СтатусОтмены = Перечисления.абс_СтатусыБюджетов.СогласованиеЦФО Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтменаСогласованиеЦФО;
				
	ИначеЕсли СтатусОтмены = Перечисления.абс_СтатусыБюджетов.СогласованиеЦФУ Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтменаСогласованиеЦФУ;
				
	ИначеЕсли СтатусОтмены = Перечисления.абс_СтатусыБюджетов.СогласованиеДирБА Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтменаСогласованиеДирБА;
		
	ИначеЕсли СтатусОтмены = Перечисления.абс_СтатусыБюджетов.СогласованиеДЭИ Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтменаСогласованиеДЭИ;

	ИначеЕсли СтатусОтмены = Перечисления.абс_СтатусыБюджетов.СогласованиеДК Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтменаСогласованиеДК;

		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВидБюджетаПроверкаНаКоректностьОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	Если ДокументВводаБюджета.абс_Бюджет = Перечисления.абс_Бюджет.абс_ДДС_ОРЕХ
		или ДокументВводаБюджета.абс_Бюджет = Перечисления.абс_Бюджет.абс_ДДС_САРЕХ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ДДС;
	ИначеЕсли ДокументВводаБюджета.абс_Бюджет = Перечисления.абс_Бюджет.абс_ОРЕХ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ОРЕХ;
	ИначеЕсли ДокументВводаБюджета.абс_Бюджет = Перечисления.абс_Бюджет.абс_САРЕХ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.САРЕХ;
	КонецЕсли;
	 
КонецПроцедуры

Процедура ДействиеПроверкаДКОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОткрытьВводБюджета();
КонецПроцедуры

Процедура ДействиеПроверкаДЭИОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОткрытьВводБюджета();
КонецПроцедуры

Процедура ВидБюджетаОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	Если ДокументВводаБюджета.абс_Бюджет = Перечисления.абс_Бюджет.абс_ДДС_ОРЕХ
		или ДокументВводаБюджета.абс_Бюджет = Перечисления.абс_Бюджет.абс_ДДС_САРЕХ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантБюджетДДС;
	ИначеЕсли ДокументВводаБюджета.абс_Бюджет = Перечисления.абс_Бюджет.абс_ОРЕХ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантТекущиеЗатраты;
	ИначеЕсли ДокументВводаБюджета.абс_Бюджет = Перечисления.абс_Бюджет.абс_САРЕХ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантКапитальныеВложения;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДействиеПроверкаДЭИПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ, ДокументВводаБюджета.Организация);
КонецПроцедуры

Процедура ДействиеПроверкаДКПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ, ДокументВводаБюджета.Организация);
КонецПроцедуры

//АБС Коломиец 19255+

Процедура УсловиеНеобходимоУтверждениеПВППроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	//ОрганизацияСогласование78 = Константы.абс_Согласование78БюджетаВключитьДля.Получить();  //АБС Коломиец 19806
	//Если ОрганизацияСогласование78 <> Справочники.Организации.ПустаяСсылка() 
	//	И ДокументВводаБюджета.Организация <> ОрганизацияСогласование78 Тогда
	//	Результат = Ложь;
	//	Возврат;
	//КонецЕсли;
	//
	ПределСуммыУтверждения = абс_БизнесПроцессы.ПолучитьПределСуммыУтвержденияПоРоли(
		Перечисления.абсВидыБизнесПроцессовТТК.СогласованиеПланаБюджета, 
		Справочники.РолиИсполнителей.ПервыйВицеПрезидент);
		
	ТЧ_Бюджет = ДокументВводаБюджета.Бюджет.Выгрузить();
	ТЧ_Бюджет.Свернуть("ЦФУ,Организация,ЦФО,Проект,БюджетнаяСтатья,ТипКонтрагента,ТипСети,КВ,ТЭО,СтавкаНДС,Валюта", "СуммаРуб");
	
	Для Каждого СтрокаБюджета Из ТЧ_Бюджет Цикл
		Если ЗначениеЗаполнено(СтрокаБюджета.БюджетнаяСтатья) И СтрокаБюджета.БюджетнаяСтатья.абс_СверхБюджет //.абс_Согласование78
		   И СтрокаБюджета.СуммаРуб >= ПределСуммыУтверждения  Тогда
		   
		   Результат = Истина;
		   Возврат;
			
		КонецЕсли;
	КонецЦикла;
	
	Результат = Ложь; 
	
КонецПроцедуры

Процедура ДействиеУтверждениеПВПОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьВводБюджета();
	
КонецПроцедуры

Процедура ДействиеУтверждениеПВППриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ОрганизацияКТТК = Справочники.Организации.НайтиПоНаименованию("КТТК");
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ, ОрганизацияКТТК);	

КонецПроцедуры

Процедура ВыборВариантаДействиеУтверждениеПВПОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	Если ДокументВводаБюджета.Статус = Перечисления.абс_СтатусыБюджетов.Утвержден Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласовано;
		
	ИначеЕсли ДокументВводаБюджета.Статус = Перечисления.абс_СтатусыБюджетов.Уточнение Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантУточнение;
		
	ИначеЕсли ДокументВводаБюджета.Статус = Перечисления.абс_СтатусыБюджетов.Отмена Тогда
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтмена;		
		
	Иначе
		
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
		
	КонецЕсли;
	
КонецПроцедуры
//АБС Коломиец 19255-
